api/app/controllers/api/v1/auctions_controller.rb

INSERT INTO "auctions" ("title", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "second tesst"], ["description", "second"], ["price", "131"], ["created_at", "2018-05-08 00:47:07.974885"], ["updated_at", "2018-05-08 00:47:07.974885"], ["user_id", 1]]
---
  def create
    q = Auction.new auction_params
    q.user = current_user
    q.save!

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    auction = Auction.find params[:id]