api/app/controllers/api/v1/bids_controller.rb

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "bids" ("bid_price", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bid_price", "13"], ["auction_id", 5], ["created_at", "2018-05-08 01:23:26.694420"], ["updated_at", "2018-05-08 01:23:26.694420"], ["user_id", 1]]
---
  def create
    b = Bid.new bid_params
    b.auction = Auction.find params[:auction_id]
    b.user = current_user
    b.save!