api/app/controllers/api/v1/tokens_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "js@winterfell.gov"], ["LIMIT", 1]]
---
  def create
    user = User.find_by_email params[:email]